# ExportPatternInfo Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternInfo Class
Members See Also
---
A value used to represent the info stored in the ExportPatternTable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExportPatternInfo : IDisposable
```

Visual Basic
---
```text
Public Class ExportPatternInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExportPatternInfo : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportPatternInfo
# See Also
ExportPatternInfo Members
Autodesk.Revit.DB Namespace